ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/inc/ht32f7xxxx_can.h
/*********************************************************************************************************//**
 * @file    ht32f7xxxx_can.h
 * @version $Rev:: 304          $
 * @date    $Date:: 2025-09-08 #$
 * @brief   The header file of the CAN library.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------------------------------------*/
#ifndef __HT32F7XXXX_CAN_H
#define __HT32F7XXXX_CAN_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"

/** @addtogroup HT32F7xxxx_Peripheral_Driver HT32F7xxxx Peripheral Driver
  * @{
  */

/** @addtogroup CAN
  * @{
  */


/* Exported types ------------------------------------------------------------------------------------------*/
/** @defgroup CAN_Exported_Types CAN exported types
  * @{
  */

/**
  * @brief  CAN init structure definition
  */
typedef struct
{
  u16 CAN_BRPrescaler;    /* Synchronisation Jump Width , Range: 1~1024.                                    */
  u8 CAN_Mode;            /* CAN_MODE_NORMAL             : Normal mode.                                     */
                          /* CAN_MODE_BASIC              : Basic mode.                                      */
                          /* CAN_MODE_SILENT             : Silent mode.                                     */
                          /* CAN_MODE_LBACK              : Loop Back Mode.                                  */
                          /* CAN_MODE_MONITORER          : Sample Point can be monitored.                   */
                          /* CAN_MODE_TX_DOMINANT        : CAN_TX pin drives a dominant.                    */
                          /* CAN_MODE_TX_RECESSIVE       : CAN_TX pin drives a recessive.                   */
  u8 CAN_SJW;             /* Synchronisation Jump Width , Range: 1~4.                                       */
  u8 CAN_TSEG0;           /* The time segment before the sample point.                                      */
  u8 CAN_TSEG1;           /* The time segment after the sample point.                                       */
  ControlStatus CAN_NART; /* Set the no automatic retransmission                                            */
} CAN_InitTypeDef;

/**
 * @brief CAN receive status structure
 */
typedef enum
{
  MSG_RX_FINISH,
  MSG_OBJ_NOT_SET,
  MSG_NOT_RECEIVED,
  MSG_OVER_RUN
} CAN_RxStatus_TypeDef;

/**
 * @brief CAN mask message structure
 */
typedef enum
{
  NO_ERROR      = 0,
  STUFF_ERROR   = 1,
  FORM_ERROR    = 2,
  ACK_ERROR     = 3,
  BIT1_EROR     = 4,
  BIT0_ERROR    = 5,
  CRC_ERROR     = 6,
  NO_CHANGE     = 7
} CAN_LastErrorCode_TypeDef;

/**
 * @brief Message ID Type Constant structure
 */
typedef enum
{
  CAN_STD_ID =  0,
  CAN_EXT_ID =  1
} CAN_IdType_Enum;

/**
 * @brief Message Frame Type Constant structure
 */
typedef enum
{
  CAN_REMOTE_FRAME =     0,
  CAN_DATA_FRAME   =     1
} CAN_FrameType_Enum;

/**
 * @brief CAN message structure
 */
typedef struct
{
  u32 Id;                          /* Arbitration ID. Rang 0x0 ~ 0x1FFFFFFF                                 */
  u32 IdMask;                      /* Arbitration ID mask. Rang 0x0 ~ 0x1FFFFFFF                            */
  u8 MsgNum;                       /* Message number                                                        */
  CAN_IdType_Enum IdType;          /* CAN_STD_ID (0x0 ~ 0x7FF) or CAN_EXT_ID (0x0 ~ 0x1FFFFFFF)             */
  CAN_FrameType_Enum FrameType;    /* CAN_REMOTE_FRAME or CAN_DATA_FRAME                                    */
} CAN_MSG_TypeDef;

#define IS_CAN_MSG_ID(ID)               (ID   < 0x20000000)
#define IS_CAN_MSG_MASK(MASK)           (MASK < 0x20000000)

/**
  * @}
  */

/* Exported constants --------------------------------------------------------------------------------------*/
/** @defgroup CAN_Exported_Constants CAN exported constants
  * @{
  */
#define IS_CAN(x)                (IS_CAN0(x) || IS_CAN1(x))
#define IS_CAN0(x)               (x == HT_CAN0)
#if (LIBCFG_CAN1)
#define IS_CAN1(x)               (x == HT_CAN1)
#else
#define IS_CAN1(x)               (0)
#endif

#define CAN_STD_FRAME_Msk           0x7FF
#define CAN_EXT_FRAME_MSB_Msk       0x1FFF
#define CAN_EXT_FRAME_LSB_Msk       0xFFFF

#define CAN_MODE_NORMAL             0
#define MSG_OBJ_TOTAL_NUM           32

/**
 * @brief CAN CR Bit Field Definitions
 */
#define CAN_CR_TEST_Pos           7                                   /*!< CAN_T::CR: TEST Position         */
#define CAN_CR_TEST               (1ul << CAN_CR_TEST_Pos)            /*!< CAN_T::CR: TEST                  */

