ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/inc/ht32f7xxxx_can.h
#define CAN_CR_CCE_Pos            6                                   /*!< CAN_T::CR: CCE Position          */
#define CAN_CR_CCE                (1ul << CAN_CR_CCE_Pos)             /*!< CAN_T::CR: CCE                   */

#define CAN_CR_DAR_Pos            5                                   /*!< CAN_T::CR: DAR Position          */
#define CAN_CR_DAR                (1ul << CAN_CR_DAR_Pos)             /*!< CAN_T::CR: DAR                   */

#define CAN_CR_EIE_Pos            3                                   /*!< CAN_T::CR: EIE Position          */
#define CAN_INT_EIE               (1ul << CAN_CR_EIE_Pos)             /*!< CAN_T::CR: EIE                   */

#define CAN_CR_SIE_Pos            2                                   /*!< CAN_T::CR: SIE Position          */
#define CAN_INT_SIE               (1ul << CAN_CR_SIE_Pos)             /*!< CAN_T::CR  SIE                   */

#define CAN_CR_IE_Pos             1                                   /*!< CAN_T::CR: IE Position           */
#define CAN_INT_IE                (1ul << CAN_CR_IE_Pos)              /*!< CAN_T::CR: IE                    */

#define CAN_INT_ALL               (CAN_INT_EIE | CAN_INT_SIE | CAN_INT_IE)

#define IS_CAN_INT(INT)           ((INT & CAN_INT_ALL) != 0)

#define CAN_CR_INIT_Pos           0                                   /*!< CAN_T::CR: INIT Position         */
#define CAN_CR_INIT               (1ul << CAN_CR_INIT_Pos)            /*!< CAN_T::CR: INIT                  */

/**
 * @brief CAN STATUS Bit Field Definitions
 */
#define CAN_BOFF_Pos        7                                      /*!< CAN_T::STATUS: BOFF Position        */
#define CAN_FLAG_BOFF       (1ul << CAN_BOFF_Pos)                  /*!< CAN_T::STATUS: BOFF Flag            */

#define CAN_EWARN_Pos       6                                      /*!< CAN_T::STATUS: EWARN Position       */
#define CAN_FLAG_EWARN      (1ul << CAN_EWARN_Pos)                 /*!< CAN_T::STATUS: EWARN Flag           */

#define CAN_EPASS_Pos       5                                      /*!< CAN_T::STATUS: EPASS Position       */
#define CAN_FLAG_EPASS      (1ul << CAN_EPASS_Pos)                 /*!< CAN_T::STATUS: EPASS Flag           */

#define CAN_RXOK_Pos        4                                      /*!< CAN_T::STATUS: RXOK Position        */
#define CAN_FLAG_RXOK       (1ul << CAN_RXOK_Pos)                  /*!< CAN_T::STATUS: RXOK Flag            */

#define CAN_TXOK_Pos        3                                      /*!< CAN_T::STATUS: TXOK Position        */
#define CAN_FLAG_TXOK       (1ul << CAN_TXOK_Pos)                  /*!< CAN_T::STATUS: TXOK Flag            */

#define CAN_LEC_Pos         0                                      /*!< CAN_T::STATUS: LEC Position         */
#define CAN_LEC_Msk         (0x7ul << CAN_LEC_Pos)                 /*!< CAN_T::STATUS: LEC Mask             */

#define IS_CAN_FLAG(FLAG)  ((FLAG & (CAN_FLAG_BOFF  | \
                                     CAN_FLAG_EPASS | \
                                     CAN_FLAG_EPASS | \
                                     CAN_FLAG_RXOK  | \
                                     CAN_FLAG_TXOK)) != 0)

/**
 * @brief CAN ECR Bit Field Definitions
 */
#define CAN_ECR_RP_Pos             15                                 /*!< CAN_T::ECR: RP Position          */
#define CAN_ECR_RP_Msk             (1ul << CAN_ECR_RP_Pos)            /*!< CAN_T::ECR: RP                   */

#define CAN_ECR_REC_Pos            8                                  /*!< CAN_T::ECR: REC Position         */
#define CAN_ECR_REC_Msk            (0x7Ful << CAN_ECR_REC_Pos)        /*!< CAN_T::ECR: REC Mask             */

#define CAN_ECR_TEC_Pos            0                                  /*!< CAN_T::ECR: TEC Position         */
#define CAN_ECR_TEC_Msk            (0xFFul << CAN_ECR_TEC_Pos)        /*!< CAN_T::ECR: TEC Mask             */

/**
 * @brief CAN BTR Bit Field Definitions
 */
#define CAN_BTR_TSEG1_Pos        12                                   /*!< CAN_T::BTR: TSEG1 Position       */
#define CAN_BTR_TSEG1_Msk        (0x7ul << CAN_BTR_TSEG1_Pos)         /*!< CAN_T::BTR: TSEG1 Mask           */

#define CAN_BTR_TSEG0_Pos        8                                    /*!< CAN_T::BTR: TSEG0 Position       */
#define CAN_BTR_TSEG0_Msk        (0xFul << CAN_BTR_TSEG0_Pos)         /*!< CAN_T::BTR: TSEG0 Mask           */

#define CAN_BTR_SJW_Pos          6                                    /*!< CAN_T::BTR: SJW Position         */
#define CAN_BTR_SJW_Msk          (0x3ul << CAN_BTR_SJW_Pos)           /*!< CAN_T::BTR: SJW Mask             */

#define CAN_BTR_BRP_Pos          0                                    /*!< CAN_T::BTR: BRP Position         */
#define CAN_BTR_BRP_Msk          (0x3Ful << CAN_BTR_BRP_Pos)          /*!< CAN_T::BTR: BRP Mask             */

#define IS_CAN_TSEG0(TSEG0)     (TSEG0 < 17)
#define IS_CAN_TSEG1(TSEG1)     (TSEG1 < 9)
#define IS_CAN_SJW(SJW)         (SJW < 5)

/**
 * @brief CAN IR Bit Field Definitions
 */
#define CAN_IR_INTID_Pos         0                                    /*!< CAN_T::IR: INTID Position        */
#define CAN_IR_INTID_Msk         (0xFFFFul << CAN_IR_INTID_Pos)       /*!< CAN_T::IR: INTID Mask            */

/**
 * @brief CAN TEST Bit Field Definitions
 */
#define CAN_TEST_RX_Pos              7                                 /*!< CAN_T::TEST: RX Position        */
#define CAN_TEST_RX                  (1ul << CAN_TEST_RX_Pos)          /*!< CAN_T::TEST: RX                 */

#define CAN_TEST_TX_Pos              5                                 /*!< CAN_T::TEST: TX Position        */
#define CAN_MODE_MONITORER          (0x1ul << CAN_TEST_TX_Pos)         /*!< CAN_T::TEST: SP monitored       */
#define CAN_MODE_TX_DOMINANT        (0x2ul << CAN_TEST_TX_Pos)         /*!< CAN_T::TEST: TX dominant        */
#define CAN_MODE_TX_RECESSIVE       (0x3ul << CAN_TEST_TX_Pos)         /*!< CAN_T::TEST: TX recessive       */

#define CAN_TEST_LBACK_Pos          4                                  /*!< CAN_T::TEST: LBACK Position     */
#define CAN_MODE_LBACK              (1ul << CAN_TEST_LBACK_Pos)        /*!< CAN_T::TEST: LBACK              */

#define CAN_TEST_SILENT_Pos         3                                  /*!< CAN_T::TEST: Silent Position    */
#define CAN_MODE_SILENT             (1ul << CAN_TEST_SILENT_Pos)       /*!< CAN_T::TEST: Silent             */

#define CAN_TEST_BASIC_Pos          2                                  /*!< CAN_T::TEST: Basic Position     */
#define CAN_MODE_BASIC              (1ul << CAN_TEST_BASIC_Pos)        /*!< CAN_T::TEST: Basic              */

