ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/inc/ht32f7xxxx_can.h
#define IS_CAN_MODE(MODE)              ((MODE == CAN_MODE_NORMAL)      || \
                                        (MODE == CAN_MODE_BASIC)       || \
                                        (MODE == CAN_MODE_SILENT)      || \
                                        (MODE == CAN_MODE_LBACK)       || \
                                        (MODE == CAN_MODE_MONITORER)   || \
                                        (MODE == CAN_MODE_TX_DOMINANT) || \
                                        (MODE == CAN_MODE_TX_RECESSIVE))

/**
 * @brief CAN BPRE Bit Field Definitions
 */
#define CAN_BRPE_BRPE_Pos          0                                  /*!< CAN_T::BRPE: BRPE Position       */
#define CAN_BRPE_BRPE_Msk          (0xFul << CAN_BRPE_BRPE_Pos)       /*!< CAN_T::BRPE: BRPE Mask           */

#define IS_CAN_BRPRESCALER(PRESCALER)  ((PRESCALER > 0) && (PRESCALER < 1025))

/**
 * @brief CAN IFn_CREQ Bit Field Definitions
 */
#define CAN_IF_CREQ_BUSY_Pos       15                                  /*!< CAN_T::IFnCREQ: BUSY Position   */
#define CAN_FLAG_IF_BUSY           (1ul << CAN_IF_CREQ_BUSY_Pos)       /*!< CAN_T::IFnCREQ: BUSY FLAG       */

#define CAN_IF_CREQ_MSGNUM_Pos     0                                   /*!< CAN_T::IFnCREQ: MSGNUM Position */
#define CAN_IF_CREQ_MSGNUM_Msk     (0x3Ful << CAN_IF_CREQ_MSGNUM_Pos)  /*!< CAN_T::IFnCREQ: MSGNUM Mask     */

/**
 * @brief CAN IFn_CMASK Bit Field Definitions
 */
#define CAN_IF_CMASK_WRRD_Pos      7                                     /*!< CAN_T::IFnCMASK: WRRD Position          */
#define CAN_IF_CMASK_WRRD      (1ul << CAN_IF_CMASK_WRRD_Pos)            /*!< CAN_T::IFnCMASK: WRRD                   */

#define CAN_IF_CMASK_MASK_Pos      6                                     /*!< CAN_T::IFnCMASK: MASK Position          */
#define CAN_IF_CMASK_MASK      (1ul << CAN_IF_CMASK_MASK_Pos)            /*!< CAN_T::IFnCMASK: MASK                   */

#define CAN_IF_CMASK_ARB_Pos       5                                     /*!< CAN_T::IFnCMASK: ARB Position           */
#define CAN_IF_CMASK_ARB       (1ul << CAN_IF_CMASK_ARB_Pos)             /*!< CAN_T::IFnCMASK: ARB                    */

#define CAN_IF_CMASK_CONTROL_Pos   4                                     /*!< CAN_T::IFnCMASK: CONTROL Position       */
#define CAN_IF_CMASK_CONTROL   (1ul << CAN_IF_CMASK_CONTROL_Pos)         /*!< CAN_T::IFnCMASK: CONTROL                */

#define CAN_IF_CMASK_CLRINTPND_Pos 3                                     /*!< CAN_T::IFnCMASK: CLRINTPND Position     */
#define CAN_IF_CMASK_CLRINTPND (1ul << CAN_IF_CMASK_CLRINTPND_Pos)       /*!< CAN_T::IFnCMASK: CLRINTPND              */

#define CAN_IF_CMASK_TXRQSTNEWDAT_Pos 2                                  /*!< CAN_T::IFnCMASK: TXRQSTNEWDAT Position  */
#define CAN_IF_CMASK_TXRQSTNEWDAT (1ul << CAN_IF_CMASK_TXRQSTNEWDAT_Pos) /*!< CAN_T::IFnCMASK: TXRQSTNEWDAT           */

#define CAN_IF_CMASK_DATAA_Pos     1                                     /*!< CAN_T::IFnCMASK: DATAA Position         */
#define CAN_IF_CMASK_DATAA     (1ul << CAN_IF_CMASK_DATAA_Pos)           /*!< CAN_T::IFnCMASK: DATAA                  */

#define CAN_IF_CMASK_DATAB_Pos     0                                     /*!< CAN_T::IFnCMASK: DATAB Position         */
#define CAN_IF_CMASK_DATAB     (1ul << CAN_IF_CMASK_DATAB_Pos)           /*!< CAN_T::IFnCMASK: DATAB                  */

/**
 * @brief CAN IFn_MASK0 Bit Field Definitions
 */
#define CAN_IF_MASK0_MSK_Pos       0                                    /*!< CAN_T::IFnMASK0: MSK Position  */
#define CAN_IF_MASK0_MSK_Msk       (0xFFFFul << CAN_IF_MASK0_MSK_Pos)   /*!< CAN_T::IFnMASK0: MSK Mask      */

/**
 * @brief CAN IFn_MASK1 Bit Field Definitions
 */
#define CAN_IF_MASK1_MXTD_Pos      15                                   /*!< CAN_T::IFnMASK1: MXTD Position */
#define CAN_IF_MASK1_MXTD          (1ul << CAN_IF_MASK1_MXTD_Pos)       /*!< CAN_T::IFnMASK1: MXTD          */

#define CAN_IF_MASK1_MDIR_Pos      14                                   /*!< CAN_T::IFnMASK1: MDIR Position */
#define CAN_IF_MASK1_MDIR          (1ul << CAN_IF_MASK1_MDIR_Pos)       /*!< CAN_T::IFnMASK1: MDIR          */

#define CAN_IF_MASK1_MSK_Pos       0                                    /*!< CAN_T::IFnMASK1: MSK Position  */
#define CAN_IF_MASK1_MSK_Msk       (0x1FFFul << CAN_IF_MASK1_MSK_Pos)   /*!< CAN_T::IFnMASK1: MSK Mask      */

/**
 * @brief CAN IFn_ARB0 Bit Field Definitions
 */
#define CAN_IF_ARB0_ID_Pos         0                                    /*!< CAN_T::IFnARB0: ID Position    */
#define CAN_IF_ARB0_ID_Msk         (0xFFFFul << CAN_IF_ARB0_ID_Pos)     /*!< CAN_T::IFnARB0: ID Mask        */

/**
 * @brief CAN IFn_ARB1 Bit Field Definitions
 */
#define CAN_IF_ARB1_MSGVAL_Pos     15                                  /*!< CAN_T::IFnARB1: MSGVAL Position */
#define CAN_IF_ARB1_MSGVAL         (1ul << CAN_IF_ARB1_MSGVAL_Pos)     /*!< CAN_T::IFnARB1: MSGVAL          */

#define CAN_IF_ARB1_XTD_Pos        14                                  /*!< CAN_T::IFnARB1: XTD Position    */
#define CAN_IF_ARB1_XTD            (1ul << CAN_IF_ARB1_XTD_Pos)        /*!< CAN_T::IFnARB1: XTD             */

#define CAN_IF_ARB1_DIR_Pos        13                                  /*!< CAN_T::IFnARB1: DIR Position    */
#define CAN_IF_ARB1_DIR            (1ul << CAN_IF_ARB1_DIR_Pos)        /*!< CAN_T::IFnARB1: DIR             */

#define CAN_IF_ARB1_ID_Pos         0                                   /*!< CAN_T::IFnARB1: ID Position     */
#define CAN_IF_ARB1_ID_Msk         (0x1FFFul << CAN_IF_ARB1_ID_Pos)    /*!< CAN_T::IFnARB1: ID Mask         */

/**
 * @brief CAN IFn_MCR Bit Field Definitions
 */
#define CAN_IF_MCR_NEWDAT_Pos     15                                   /*!< CAN_T::IFnMCON: NEWDAT Position */
#define CAN_IF_MCR_NEWDAT         (1ul << CAN_IF_MCR_NEWDAT_Pos)       /*!< CAN_T::IFnMCON: NEWDAT          */

#define CAN_IF_MCR_MSGLST_Pos     14                                   /*!< CAN_T::IFnMCON: MSGLST Position */
#define CAN_IF_MCR_MSGLST         (1ul << CAN_IF_MCR_MSGLST_Pos)       /*!< CAN_T::IFnMCON: MSGLST          */

#define CAN_IF_MCR_INTPND_Pos     13                                   /*!< CAN_T::IFnMCON: INTPND Position */
#define CAN_IF_MCR_INTPND         (1ul << CAN_IF_MCR_INTPND_Pos)       /*!< CAN_T::IFnMCON: INTPND          */

#define CAN_IF_MCR_UMASK_Pos      12                                   /*!< CAN_T::IFnMCON: UMASK Position  */
#define CAN_IF_MCR_UMASK          (1ul << CAN_IF_MCR_UMASK_Pos)        /*!< CAN_T::IFnMCON: UMASK           */

